In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [2]:
redwood = pd.read_csv('./data/visitornumbers/redwood.csv')

In [3]:
redwood.head(2)

,Year,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,YearTotal
0,2022,20630,20202,27390,34053,44887,59736,68544,60003,49954,38004,19904,15093,458400
1,2021,19790,19708,20645,24290,43346,53024,56573,58121,57927,38708,23828,19919,435879

In [4]:
redwood.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       44 non-null     int64
 1   JAN        44 non-null     int64
 2   FEB        44 non-null     int64
 3   MAR        44 non-null     int64
 4   APR        44 non-null     int64
 5   MAY        44 non-null     int64
 6   JUN        44 non-null     int64
 7   JUL        44 non-null     int64
 8   AUG        44 non-null     int64
 9   SEP        44 non-null     int64
 10  OCT        44 non-null     int64
 11  NOV        44 non-null     int64
 12  DEC        44 non-null     int64
 13  YearTotal  44 non-null     int64
dtypes: int64(14)
memory usage: 4.9 KB

In [5]:
redwood.loc[:, 'JAN'].mean()

16800.954545454544

In [6]:
redwoodtotals = redwood.loc[:, ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']].mean()

In [7]:
redwoodtotals = redwoodtotals.to_frame().reset_index()

In [8]:
redwoodtotals.columns = ['month', 'visitors'] 
redwoodtotals

   month      visitors
0    JAN  16800.954545
1    FEB  16494.863636
2    MAR  21915.000000
3    APR  28054.000000
4    MAY  39140.159091
5    JUN  55576.386364
6    JUL  76110.181818
7    AUG  71786.250000
8    SEP  50201.681818
9    OCT  32591.295455
10   NOV  19134.590909
11   DEC  17249.340909

In [9]:
redwoodtotals.to_csv('redwoodtotals.csv')

In [10]:
craterlake = pd.read_csv('./data/visitornumbers/craterlake.csv')
craterlake.head(2)

,Year,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,YearTotal
0,2022,6752,9213,11933,14779,31822,70975,139513,107351,78967,39989,10481,5484,527259
1,2021,8026,7803,15312,25680,56746,95155,194712,106379,64152,47196,19410,7180,647751

In [11]:
craterlake.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       44 non-null     int64
 1   JAN        44 non-null     int64
 2   FEB        44 non-null     int64
 3   MAR        44 non-null     int64
 4   APR        44 non-null     int64
 5   MAY        44 non-null     int64
 6   JUN        44 non-null     int64
 7   JUL        44 non-null     int64
 8   AUG        44 non-null     int64
 9   SEP        44 non-null     int64
 10  OCT        44 non-null     int64
 11  NOV        44 non-null     int64
 12  DEC        44 non-null     int64
 13  YearTotal  44 non-null     int64
dtypes: int64(14)
memory usage: 4.9 KB

In [12]:
craterlaketotals = craterlake.loc[:, ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']].mean()
craterlaketotals = craterlaketotals.to_frame().reset_index()

In [13]:
craterlaketotals.columns = ['month', 'visitors'] 
craterlaketotals

   month       visitors
0    JAN    6111.159091
1    FEB    5845.909091
2    MAR    8703.181818
3    APR   12609.477273
4    MAY   28744.250000
5    JUN   63186.522727
6    JUL  118799.522727
7    AUG  116929.250000
8    SEP   73454.363636
9    OCT   34114.545455
10   NOV    9986.454545
11   DEC    6092.022727

In [14]:
craterlaketotals.to_csv('craterlaketotals.csv')

In [15]:
goldengate = pd.read_csv('./data/visitornumbers/goldengate.csv')
goldengate.head(2)

,Year,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,YearTotal
0,2022,1012454,1020494,1221045,1284656,1304695,1487409,1634356,1645914,1311460,1281009,1223099,1212320,15638911
1,2021,961888,982842,1131635,1005929,1053192,1368336,1244654,1561906,1196694,1193305,1049628,962605,13712614

In [16]:
goldengate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       44 non-null     int64
 1   JAN        44 non-null     int64
 2   FEB        44 non-null     int64
 3   MAR        44 non-null     int64
 4   APR        44 non-null     int64
 5   MAY        44 non-null     int64
 6   JUN        44 non-null     int64
 7   JUL        44 non-null     int64
 8   AUG        44 non-null     int64
 9   SEP        44 non-null     int64
 10  OCT        44 non-null     int64
 11  NOV        44 non-null     int64
 12  DEC        44 non-null     int64
 13  YearTotal  44 non-null     int64
dtypes: int64(14)
memory usage: 4.9 KB

In [17]:
goldengatetotals = goldengate.loc[:, ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']].mean()
goldengatetotals = goldengatetotals.to_frame().reset_index()

In [18]:
goldengatetotals.columns = ['month', 'visitors'] 
goldengatetotals

   month      visitors
0    JAN  1.050029e+06
1    FEB  1.070959e+06
2    MAR  1.190669e+06
3    APR  1.297266e+06
4    MAY  1.352210e+06
5    JUN  1.488293e+06
6    JUL  1.567520e+06
7    AUG  1.529698e+06
8    SEP  1.433601e+06
9    OCT  1.319334e+06
10   NOV  1.107402e+06
11   DEC  1.032338e+06

In [19]:
goldengatetotals.to_csv('goldengatetotals.csv')

In [20]:
sequoia = pd.read_csv('./data/visitornumbers/sequoia.csv')
sequoia.head(2)

,Year,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,YearTotal
0,2022,32564,39182,58365,86412,121934,135869,188020,170284,127041,96663,55800,41064,1153198
1,2021,65177,54162,79431,103101,134360,162201,182423,155567,50597,22545,25406,24578,1059548

In [21]:
sequoia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       44 non-null     int64
 1   JAN        44 non-null     int64
 2   FEB        44 non-null     int64
 3   MAR        44 non-null     int64
 4   APR        44 non-null     int64
 5   MAY        44 non-null     int64
 6   JUN        44 non-null     int64
 7   JUL        44 non-null     int64
 8   AUG        44 non-null     int64
 9   SEP        44 non-null     int64
 10  OCT        44 non-null     int64
 11  NOV        44 non-null     int64
 12  DEC        44 non-null     int64
 13  YearTotal  44 non-null     int64
dtypes: int64(14)
memory usage: 4.9 KB

In [22]:
sequoiatotals = sequoia.loc[:, ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']].mean()

In [23]:
sequoiatotals = sequoiatotals.to_frame().reset_index()
sequoiatotals.columns = ['month', 'visitors'] 
sequoiatotals

   month       visitors
0    JAN   29513.204545
1    FEB   27320.022727
2    MAR   39933.113636
3    APR   58170.318182
4    MAY  105768.136364
5    JUN  129513.704545
6    JUL  180622.000000
7    AUG  179385.772727
8    SEP  112951.113636
9    OCT   68454.795455
10   NOV   41096.750000
11   DEC   30205.750000

In [24]:
sequoiatotals.to_csv('sequoiatotals.csv')

In [25]:
yosemite = pd.read_csv('./data/visitornumbers/yosemite.csv')
yosemite.head(2)

,Year,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,YearTotal
0,2022,137057,170196,192634,285601,380905,470045,396833,518407,424374,381612,178786,131100,3667550
1,2021,67284,128222,159906,257158,348006,429980,509874,432038,356030,284611,185213,129273,3287595

In [26]:
yosemite.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       44 non-null     int64
 1   JAN        44 non-null     int64
 2   FEB        44 non-null     int64
 3   MAR        44 non-null     int64
 4   APR        44 non-null     int64
 5   MAY        44 non-null     int64
 6   JUN        44 non-null     int64
 7   JUL        44 non-null     int64
 8   AUG        44 non-null     int64
 9   SEP        44 non-null     int64
 10  OCT        44 non-null     int64
 11  NOV        44 non-null     int64
 12  DEC        44 non-null     int64
 13  YearTotal  44 non-null     int64
dtypes: int64(14)
memory usage: 4.9 KB

In [27]:
yosemitetotals = yosemite.loc[:, ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']].mean()

In [28]:
yosemitetotals = yosemitetotals.to_frame().reset_index()
yosemitetotals.columns = ['month', 'visitors'] 
yosemitetotals

   month       visitors
0    JAN  100208.250000
1    FEB  108878.590909
2    MAR  140220.340909
3    APR  207010.045455
4    MAY  331738.590909
5    JUN  440650.090909
6    JUL  543692.068182
7    AUG  561402.159091
8    SEP  432496.522727
9    OCT  314355.204545
10   NOV  154191.272727
11   DEC  115428.386364

In [29]:
yosemitetotals.to_csv('yosemitetotals.csv')